namespace Sources.BoundedContexts
{
    public class CheatSheet
    {
        //TODO
        //Добавить на все префабы персонажей компоненты для динамического запекания (добавил но покашто не работают анимации)
        //Добавить звуки для нажития кнопок (готово)
        //Доработать логику спанера врагов - (Готово)
        //Добавить оружие для миликов - (Готово)
        //Заменить префаб босса - (готово)
        //Пофиксить ошибку с UiSelectableAnimator (готово)
        //Добавить звук на открытие и закрытие курточки (готово)
        //Пофиксить логи поиска противников, персонаже не бьют боссов (готово)
        //Пофиксить ошибку с DontDestroyOnLoad в DeepBrain (Готово)
        //Починить урон от бомбы (готово)
        //Проверить работу всего юая (готово) но нужно еще проверять
        //Пофиксить инициализацию юая бункера(готово)
        //Объединить меш на игровой сцене (готово)
        //Добавить возможность раскачивания травы (готово)
        //Добавить яндекс сдк и разобраться в документации(Готово но нужно проверить)
        //Заменить надпись в главном меню для названия игры (Готово Выключил его)
        //Изменить описание первого тутора(Готово)
        //При попытке просмотреть видио за вознаграждение всплавает вьюшка выхода из игры(Готово)
        //Увеличить разрешиние шторки(готово)
        //Убрать 4х боссов из первой волны(Готово)
        //Убрать пополнение кошелька в начале загруженой игры(Готово)
        //Починить массовую атаку у босса и добавить партикл массовой атаки и анимацию(Готово но нет анимации)
        //Плохо работает фокус сервис(Готово)
        //Расширить альфа канал у картинок таймеров способностей(Сделал но работает не корректно)
        //Плохо выглядят тени(Готово)
        //Не изменяется значение бустеров(Готово)
        //Не работает сброс сохраненной игры и запуск(Готово)

        //Доработать изменение скейла юая
        //обобщить метод GetAnimaName в экшнах энеми методах передвижения обобщить этот метод
        //разделить DamageSystem на 3 системы
        //доработать Despawn в CharacterSpawner
        //В BurnSystem добавить скалирование урона в зависимости от уровня прокачки FlamethrowerUpgrade
        //Добавить мерцание замка как в первой итерации
        //Добавить музыку заднего фона
        //Доработать логику спавн конфига для того чтобы можно было автоматически создать все конфиги и переодически сложность волны ослаблялась
        //отрефакторить утилсы для ассет папок
        //Сделать генератор для евентов что бы они добавлялись в DelHere
        //Заменить партиклы кругов для спавн поинтов персонажей
        //Добавить в сервис звуков возможность добавления пресетов как в Embience Village
        //Убрать паузу звуков из пауз сервиса
        //Добавить логику изменения громкости у саунд контроллеров с учетом значений в конфиге
        //На все используемые префабы на меш рендерерах поставить статик shadow casters
        //Добавить яндекс митрику
        //Добавить шоп
        //Добавить в проект фмод
        //Добавить мета предметы и коллектабыл
        //Заменить Юай
        //Добавить звук предупреждения на всплывающие вьюшки
        //Сделать отдельную загрузку для префабов UI Для разных сцен
        //Добавить магазин предметов
        //Добавить механику выбора способностей ао прошествии нескольких волн предлагать карточки со способностями
        //Добавить на юай вьюшку с данными пользователя

        //1
        //написать в поддержку по поводу РСЯ чтобы добавить карточку
        //Проверить настройки монетизации в черновике
        //Проверить спавнер врагов. Справа появляются партиклы взрыва камикадзе
        //После Unpause в DeepSoundController сдклать проверку на длину клипа
        //Добавить логику для серверного времени с сдк
        //Иногда даже если звук в муте то проигрывается звук клавиш
        //Проверить логику лупа музыки
        //Плохо отрабатывает логика настроек звука
        //Доработать баланс
        //Поставить другую компрессию для текстур
        //Уменьшить ренж атаки у дальних бойцов
    }
}